michael-hirschmugl/Arduino-Due-DSP-Firmware/sam3x8e_register_definitions.h
/*
  sam3x8e_register_definitions.h

  Defines for peripheral registers of the SAM3X8E.

  By Michael Hirschmugl
*/

#ifndef SAM3X8E_REGISTER_DEFINITIONS_H
#define SAM3X8E_REGISTER_DEFINITIONS_H

#define WPEN_0                  (0U << 0)
#define WPEN_1                  (1U << 0)

#define TWI1_PID                (1U << 23)
#define SSC_PID                 (1U << 26)
#define ADC_PID                 (1U << 5)  // PID 37
#define DIN_PID                 (1U << 14)
#define DOUT_PID                (1U << 13)
#define DAC_PID                 (1U << 6)  // PID 38

/* EEFC Flash Mode Register RW */
#define EEFC_FMR0               (*((volatile unsigned long *)0x400E0A00U))
#define EEFC_FMR1               (*((volatile unsigned long *)0x400E0C00U))

/* PMC (Power Management Controller) Write Protect Mode Register */
#define PMC_WPMR                (*((volatile unsigned long *)0x400E06E4U))
#define PMC_WPKEY               (0x504D43U << 8)

/* PMC Clock Generator Main Oscillator register RW */
#define PMC_CKGR_MOR            (*((volatile unsigned long *)0x400E0620U))
#define PMC_CKGR_MOR_KEY        (0x37U << 16)

/* PMC Status register RO */
#define PMC_SR                  (*((volatile unsigned long *)0x400E0668U))
#define PMC_SR_MOSCXTS          (0U << 0)
#define PMC_SR_LOCKA            (0U << 1)
#define PMC_SR_MCKRDY           (1U << 3)
#define PMC_SR_LOCKU            (1U << 6)
#define PMC_SR_PCKRDY0          (1U << 8)
#define PMC_SR_PCKRDY1          (1U << 9)
#define PMC_SR_PCKRDY2          (1U << 10)
#define PMC_SR_MOSCSELS         (1U << 16)
#define PMC_SR_MOSCRCS          (1U << 17)
#define PMC_SR_CFDEV            (1U << 18)

/* PMC PLLA Register RW */
#define PMC_CKGR_PLLAR          (*((volatile unsigned long *)0x400E0628U))
#define PMC_CKGR_PLLAR_ONE      (1U << 29)

/* PMC Master Clock register RW */
#define PMC_MCKR                (*((volatile unsigned long *)0x400E0630U))
#define PMC_MCKR_CSS_MSK        (0x3U << 0)
#define PMC_MCKR_PRES_MSK       (0x7U << 4)
#define PMC_MCKR_PLLADIV2_MSK   (1U << 12)
#define PMC_MCKR_UPLLDIV2_MSK   (1U << 13)

/* System Clock Enable Register WO */
#define PMC_SCER                (*((volatile unsigned long *)0x400E0600U))
/* Programmable Clock 0 Register RW */
#define PMC_PCK0                (*((volatile unsigned long *)0x400E0640U))

/* PMC Main Clock Frequency Register */
#define PMC_CKGR_MCFR           (*((volatile unsigned long *)0x400E0624U))
#define PMC_CKGR_MCFR_MAINF_MSK (0xFFFFU << 0)
#define PMC_CKGR_MCFR_MAINFRDY  (1U << 16)

/* PMC Peripheral Clock Enable Register 0 WO */
#define PMC_PCER0               (*((volatile unsigned long *)0x400E0610U))
/* PMC Peripheral Clock Status Register 0 RO */
#define PMC_PCSR0               (*((volatile unsigned long *)0x400E0618U))
/* PMC Peripheral Clock Enable Register 1 WO */
#define PMC_PCER1               (*((volatile unsigned long *)0x400E0700U))
/* PMC Peripheral Clock Status Register 1 RO */
#define PMC_PCSR1               (*((volatile unsigned long *)0x400E0708U))

/* PIO Write Protect Mode Registers */
#define PIOA_WPMR               (*((volatile unsigned long *)0x400E0EE4U))
#define PIOB_WPMR               (*((volatile unsigned long *)0x400E10E4U))
#define PIOC_WPMR               (*((volatile unsigned long *)0x400E12E4U))
#define PIOD_WPMR               (*((volatile unsigned long *)0x400E14E4U))
#define PIO_WPKEY               (0x50494FU << 8)

/* PIO Enable Register WO */
#define PIOA_PER                (*((volatile unsigned long *)0x400E0E00U))
#define PIOC_PER                (*((volatile unsigned long *)0x400E1200U))
#define PIOD_PER                (*((volatile unsigned long *)0x400E1400U))

/* PIO Disable Register WO */
#define PIOA_PDR                (*((volatile unsigned long *)0x400E0E04U))
#define PIOB_PDR                (*((volatile unsigned long *)0x400E1004U))

/* PIO Status Register RO */
#define PIOA_PSR                (*((volatile unsigned long *)0x400E0E08U))
#define PIOB_PSR                (*((volatile unsigned long *)0x400E1008U))
#define PIOC_PSR                (*((volatile unsigned long *)0x400E1208U))
#define PIOD_PSR                (*((volatile unsigned long *)0x400E1408U))

/* Output Enable Register WO */
#define PIOA_OER                (*((volatile unsigned long *)0x400E0E10U))
#define PIOC_OER                (*((volatile unsigned long *)0x400E1210U))

/* Output Disable Register WO */
#define PIOA_ODR                (*((volatile unsigned long *)0x400E0E14U))
#define PIOD_ODR                (*((volatile unsigned long *)0x400E1414U))

/* Output Status Register RO */
#define PIOA_OSR                (*((volatile unsigned long *)0x400E0E18U))
#define PIOC_OSR                (*((volatile unsigned long *)0x400E1218U))

/* PIO Set Output Data Register WO */
#define PIOC_SODR               (*((volatile unsigned long *)0x400E1230U))

/* PIO Clear Output Data Register WO */
#define PIOC_CODR               (*((volatile unsigned long *)0x400E1234U))

/* PIO Output Data Status Register WO */
#define PIOC_ODSR               (*((volatile unsigned long *)0x400E1238U))

/* Pull-up Disable Register WO */
#define PIOA_PUDR               (*((volatile unsigned long *)0x400E0E60U))
#define PIOB_PUDR               (*((volatile unsigned long *)0x400E1060U))
#define PIOC_PUDR               (*((volatile unsigned long *)0x400E1260U))
#define PIOD_PUDR               (*((volatile unsigned long *)0x400E1460U))

/* Pad Pull-up Status Register RO */
#define PIOA_PUSR               (*((volatile unsigned long *)0x400E0E68U))
#define PIOB_PUSR               (*((volatile unsigned long *)0x400E1068U))

/* Peripheral AB Select Register RW */
#define PIOA_ABSR               (*((volatile unsigned long *)0x400E0E70U))
#define PIOB_ABSR               (*((volatile unsigned long *)0x400E1070U))

/* Interrupt Enable Register WO */
#define PIOD_IER                (*((volatile unsigned long *)0x400E1440U))
/* Interrupt Mask Register RO */
#define PIOD_IMR                (*((volatile unsigned long *)0x400E1448U))

/* Glitch Input Filter Enable Register WO */
#define PIOD_IFER               (*((volatile unsigned long *)0x400E1420U))

/* Level Select Register WO */
#define PIOD_LSR                (*((volatile unsigned long *)0x400E14C4U))

