michael-hirschmugl/Arduino-Due-DSP-Firmware/sam3x8e_register_definitions.h
/* Debouncing Input Filter Select Register WO */
#define PIOD_DIFSR              (*((volatile unsigned long *)0x400E1484U))

/* Pin Data Status Register RO */
#define PIOD_PDSR               (*((volatile unsigned long *)0x400E143CU))

/* Interrupt Control Registers */
#define INTERRUPT0_ENABLE       (*((volatile unsigned long *)0xE000E100U))
#define INTERRUPT1_ENABLE       (*((volatile unsigned long *)0xE000E104U))
#define INTERRUPT0_DISABLE      (*((volatile unsigned long *)0xE000E180U))
#define INTERRUPT0_CLEAR_PENDING (*((volatile unsigned long *)0xE000E280U))
#define INTERRUPT_PRIORITY_REG_3 (*((volatile unsigned long *)(0xE000E400U \
                                 + (3))))
#define INTERRUPT_PRIORITY_REG_6 (*((volatile unsigned long *)(0xE000E400U \
                                 + (6))))

#define DAC_WPMR                (*((volatile unsigned long *)0x400C80E4U))
#define DAC_CR                  (*((volatile unsigned long *)0x400C8000U))
#define DAC_MR                  (*((volatile unsigned long *)0x400C8004U))
#define DAC_WORD                (0x00U << 4)
#define DAC_REFRESH             (0xFFU << 8)
#define DAC_MAXS                (0x01U << 21)
#define DAC_STARTUP             (0x08U << 24)
#define DAC_WPKEY               (0x444143U << 8)
#define DAC_CHER                (*((volatile unsigned long *)0x400C8010U))
#define DAC_CDR                 (*((volatile unsigned long *)0x400C8020U))


/* ADC Write Protect Mode Register */
#define ADC_WPMR                (*((volatile unsigned long *)0x400C00E4U))
#define ADC_WPKEY               (0x414443U << 8)

/* ADC Channel Enable Register WO */
#define ADC_CHER                (*((volatile unsigned long *)0x400C0010U))
/* ADC Channel Status Register RO */
#define ADC_CHSR                (*((volatile unsigned long *)0x400C0018U))

/* ADC Channel Data Register AD3 */
#define ADC_DATA_MEASURE        (*((volatile unsigned long *)0x400C005CU))
/* ADC Channel Data Register AD4 */
#define ADC_CDR_AD4             (*((volatile unsigned long *)0x400C0060U))
/* ADC Channel Data Register AD5 */
#define ADC_CDR_AD5             (*((volatile unsigned long *)0x400C0064U))
/* ADC Channel Data Register AD6 */
#define ADC_CDR_AD6             (*((volatile unsigned long *)0x400C0068U))

/* ADC Control Register */
#define ADC_CR                  (*((volatile unsigned long *)0x400C0000U))
#define ADC_CR_SWRST            (1U << 0)
#define ADC_CR_START            (1U << 1)

/* ADC Mode Register */
#define ADC_MR                  (*((volatile unsigned long *)0x400C0004U))

/* TWI Clock Waveform Generator Register RW */
#define TWI1_CWGR               (*((volatile unsigned long *)0x40090010U))

/* TWI1 Control Register WO */
#define TWI1_CR                 (*((volatile unsigned long *)0x40090000U))
#define TWI1_CR_START           (0U << 0)
#define TWI1_CR_STOP            (1U << 1)
#define TWI1_CR_QUICK           (0U << 6)
#define TWI1_CR_SWRST           (1U << 7)

/* TWI1 Master Mode Register RW */
#define TWI1_MMR                (*((volatile unsigned long *)0x40090004U))

/* TWI1 Transmit Holding Register RW */
#define TWI1_THR                (*((volatile unsigned long *)0x40090034U))

/* TWI1 Status Register RO */
#define TWI1_SR                 (*((volatile unsigned long *)0x40090020U))
#define TWI1_SR_TXRDY           (1U << 2)
#define TWI1_SR_TXCOMP          (1U << 0)
#define TWI1_SR_NACK            (1U << 8)

/* SSC Control Register WO */
#define SSC_CR                  (*((volatile unsigned long *)0x40004000U))
#define SSC_CR_RXEN             (1U << 0)
#define SSC_CR_RXDIS            (0U << 1)
#define SSC_CR_TXEN             (1U << 8)
#define SSC_CR_TXDIS            (0U << 9)
#define SSC_CR_SWRST_SSC        (1U << 15)

/* SSC Clock Mode Register RW */
#define SSC_CMR                 (*((volatile unsigned long *)0x40004004U))
#define SSC_CMR_DIV             (0x000U << 0)

/* SSC Write Protect Mode Register */
#define SSC_WPMR                (*((volatile unsigned long *)0x400040E4U))
#define SSC_WPKEY               (0x535343U << 8)

/* SSC Receive Clock Mode Register RW */
#define SSC_RCMR                (*((volatile unsigned long *)0x40004010U))

/* SSC Receive Frame Mode Register RW */
#define SSC_RFMR                (*((volatile unsigned long *)0x40004014U))

#define SSC_TCMR                (*((volatile unsigned long *)0x40004018U))
#define SSC_TCKS                (0x2U << 0)
#define SSC_TCKO                (0x0U << 2)
#define SSC_TCKI                (1U << 5)
#define SSC_TCKG                (0x0U << 6)
#define SSC_TSTART              (0x1U << 8)
#define SSC_TSTTDLY             (0x01U << 16)
#define SSC_TPERIOD             (0x00U << 24)

#define SSC_TFMR                (*((volatile unsigned long *)0x4000401CU))
#define SSC_TDATDEF             (0U << 5)
#define SSC_TMSBF               (1U << 7)
#define SSC_TDATNB              (0x0U << 8)
#define SSC_TFSLEN              (0x0U << 16)
#define SSC_TFSOS               (0x0U << 20)
#define SSC_TFSDEN              (1U << 23)
#define SSC_TFSEDGE             (0U << 24)
#define SSC_TFSLEN_EXT          (0x0U << 28)

#define SSC_RHR                 (*((volatile unsigned long *)0x40004020U))
#define SSC_RDAT                (0xFFFFFFFFU << 0)

#define SSC_THR                 (*((volatile unsigned long *)0x40004024U))
#define SSC_TDAT                (0xFFFFFFFFU << 0)

#define SSC_RSHR                (*((volatile unsigned long *)0x40004030U))
#define SSC_RSDAT               (0xFFFFU << 0)

#define SSC_TSHR                (*((volatile unsigned long *)0x40004034U))
#define SSC_TSDAT               (0xFFFFU << 0)

#define SSC_SR                  (*((volatile unsigned long *)0x40004040U))
#define SSC_TXRDY               (1U << 0)
#define SSC_TXEMPTY             (1U << 1)
#define SSC_RXRDY               (1U << 4)
#define SSC_OVRUN               (1U << 5)
#define SSC_TXSYN               (1U << 10)
#define SSC_RXSYN               (1U << 11)
#define SSC_TXEN                (1U << 16)
#define SSC_RXEN                (1U << 17)

#define SSC_IER                 (*((volatile unsigned long *)0x40004044U))
#define SSC_IETXRDY             (0U << 0)
#define SSC_IETXEMPTY           (0U << 1)
#define SSC_IERXRDY             (1U << 4)
#define SSC_IEOVRUN             (0U << 5)
#define SSC_IECP0               (0U << 8)
#define SSC_IECP1               (0U << 9)
#define SSC_IETXSYN             (0U << 10)
#define SSC_IERXSYN             (0U << 11)

#define SSC_IDR                 (*((volatile unsigned long *)0x40004048U))
#define SSC_IDTXRDY             (1U << 0)
#define SSC_IDTXEMPTY           (1U << 1)
#define SSC_IDRXRDY             (0U << 4)
#define SSC_IDOVRUN             (1U << 5)
#define SSC_IDCP0               (1U << 8)
#define SSC_IDCP1               (1U << 9)
#define SSC_IDTXSYN             (1U << 10)
#define SSC_IDRXSYN             (1U << 11)

#define SSC_IMR                 (*((volatile unsigned long *)0x4000404CU))
#define SSC_IMTXRDY             (0U << 0)
#define SSC_IMTXEMPTY           (0U << 1)
#define SSC_IMRXRDY             (1U << 4)
#define SSC_IMOVRUN             (0U << 5)
#define SSC_IMCP0               (0U << 8)
#define SSC_IMCP1               (0U << 9)
#define SSC_IMTXSYN             (0U << 10)
#define SSC_IMRXSYN             (0U << 11)


