michael-hirschmugl/Arduino-Due-DSP-Firmware/sam3x8e_register_definitions.h
#define DMAC_GCFG               (*((volatile unsigned long *)0x400C4000U))
#define DMAC_ARB_CFG            (1U << 4)
#define DMAC_EN                 (*((volatile unsigned long *)0x400C4004U))
#define DMAC_ENABLE             (1U << 0)
#define DMAC_SREQ               (*((volatile unsigned long *)0x400C4008U))
#define DMAC_DSREQ0             (0U << 1)
#define DMAC_SSREQ0             (0U << 0)
#define DMAC_DSREQ1             (0U << 3)
#define DMAC_SSREQ1             (0U << 2)
#define DMAC_DSREQ2             (0U << 5)
#define DMAC_SSREQ2             (0U << 4)
#define DMAC_DSREQ3             (0U << 7)
#define DMAC_SSREQ3             (0U << 6)
#define DMAC_DSREQ4             (0U << 9)
#define DMAC_SSREQ4             (0U << 8)
#define DMAC_DSREQ5             (0U << 11)
#define DMAC_SSREQ5             (0U << 10)
#define DMAC_CREQ               (*((volatile unsigned long *)0x400C400CU))
#define DMAC_DCREQ0             (0U << 1)
#define DMAC_SCREQ0             (0U << 0)
#define DMAC_DCREQ1             (0U << 3)
#define DMAC_SCREQ1             (0U << 2)
#define DMAC_DCREQ2             (0U << 5)
#define DMAC_SCREQ2             (0U << 4)
#define DMAC_DCREQ3             (0U << 7)
#define DMAC_SCREQ3             (0U << 6)
#define DMAC_DCREQ4             (0U << 9)
#define DMAC_SCREQ4             (0U << 8)
#define DMAC_DCREQ5             (0U << 11)
#define DMAC_SCREQ5             (0U << 10)
#define DMAC_LAST               (*((volatile unsigned long *)0x400C4010U))
#define DMAC_DLAST0             (0U << 1)
#define DMAC_SLAST0             (0U << 0)
#define DMAC_DLAST1             (0U << 3)
#define DMAC_SLAST1             (0U << 2)
#define DMAC_DLAST2             (0U << 5)
#define DMAC_SLAST2             (0U << 4)
#define DMAC_DLAST3             (0U << 7)
#define DMAC_SLAST3             (0U << 6)
#define DMAC_DLAST4             (0U << 9)
#define DMAC_SLAST4             (0U << 8)
#define DMAC_DLAST5             (0U << 11)
#define DMAC_SLAST5             (0U << 10)
#define DMAC_EBCIER             (*((volatile unsigned long *)0x400C4018U))
#define DMAC_EBCIER_BTC0        (1U << 0)
#define DMAC_EBCIER_BTC1        (0U << 1)
#define DMAC_EBCIER_BTC2        (0U << 2)
#define DMAC_EBCIER_BTC3        (0U << 3)
#define DMAC_EBCIER_BTC4        (0U << 4)
#define DMAC_EBCIER_BTC5        (0U << 5)
#define DMAC_EBCIER_CBTC0       (1U << 8)
#define DMAC_EBCIER_CBTC1       (0U << 9)
#define DMAC_EBCIER_CBTC2       (0U << 10)
#define DMAC_EBCIER_CBTC3       (0U << 11)
#define DMAC_EBCIER_CBTC4       (0U << 12)
#define DMAC_EBCIER_CBTC5       (0U << 13)
#define DMAC_EBCIER_ERR0        (1U << 16)
#define DMAC_EBCIER_ERR1        (0U << 17)
#define DMAC_EBCIER_ERR2        (0U << 18)
#define DMAC_EBCIER_ERR3        (0U << 19)
#define DMAC_EBCIER_ERR4        (0U << 20)
#define DMAC_EBCIER_ERR5        (0U << 21)
#define DMAC_EBCIDR             (*((volatile unsigned long *)0x400C401CU))
#define DMAC_EBCIDR_BTC0        (0U << 0)
#define DMAC_EBCIDR_BTC1        (0U << 1)
#define DMAC_EBCIDR_BTC2        (0U << 2)
#define DMAC_EBCIDR_BTC3        (0U << 3)
#define DMAC_EBCIDR_BTC4        (0U << 4)
#define DMAC_EBCIDR_BTC5        (0U << 5)
#define DMAC_EBCIDR_CBTC0       (0U << 8)
#define DMAC_EBCIDR_CBTC1       (0U << 9)
#define DMAC_EBCIDR_CBTC2       (0U << 10)
#define DMAC_EBCIDR_CBTC3       (0U << 11)
#define DMAC_EBCIDR_CBTC4       (0U << 12)
#define DMAC_EBCIDR_CBTC5       (0U << 13)
#define DMAC_EBCIDR_ERR0        (0U << 16)
#define DMAC_EBCIDR_ERR1        (0U << 17)
#define DMAC_EBCIDR_ERR2        (0U << 18)
#define DMAC_EBCIDR_ERR3        (0U << 19)
#define DMAC_EBCIDR_ERR4        (0U << 20)
#define DMAC_EBCIDR_ERR5        (0U << 21)
#define DMAC_EBCIMR             (*((volatile unsigned long *)0x400C4020U))
#define DMAC_EBCIMR_BTC0        (1U << 0)
#define DMAC_EBCIMR_BTC1        (1U << 1)
#define DMAC_EBCIMR_BTC2        (1U << 2)
#define DMAC_EBCIMR_BTC3        (1U << 3)
#define DMAC_EBCIMR_BTC4        (1U << 4)
#define DMAC_EBCIMR_BTC5        (1U << 5)
#define DMAC_EBCIMR_CBTC0       (1U << 8)
#define DMAC_EBCIMR_CBTC1       (1U << 9)
#define DMAC_EBCIMR_CBTC2       (1U << 10)
#define DMAC_EBCIMR_CBTC3       (1U << 11)
#define DMAC_EBCIMR_CBTC4       (1U << 12)
#define DMAC_EBCIMR_CBTC5       (1U << 13)
#define DMAC_EBCIMR_ERR0        (1U << 16)
#define DMAC_EBCIMR_ERR1        (1U << 17)
#define DMAC_EBCIMR_ERR2        (1U << 18)
#define DMAC_EBCIMR_ERR3        (1U << 19)
#define DMAC_EBCIMR_ERR4        (1U << 20)
#define DMAC_EBCIMR_ERR5        (1U << 21)
#define DMAC_EBCISR             (*((volatile unsigned long *)0x400C4024U))
#define DMAC_EBCISR_BTC0        (0U << 0)
#define DMAC_EBCISR_BTC1        (0U << 1)
#define DMAC_EBCISR_BTC2        (0U << 2)
#define DMAC_EBCISR_BTC3        (0U << 3)
#define DMAC_EBCISR_BTC4        (0U << 4)
#define DMAC_EBCISR_BTC5        (0U << 5)
#define DMAC_EBCISR_CBTC0       (0U << 8)
#define DMAC_EBCISR_CBTC1       (0U << 9)
#define DMAC_EBCISR_CBTC2       (0U << 10)
#define DMAC_EBCISR_CBTC3       (0U << 11)
#define DMAC_EBCISR_CBTC4       (0U << 12)
#define DMAC_EBCISR_CBTC5       (0U << 13)
#define DMAC_EBCISR_ERR0        (0U << 16)
#define DMAC_EBCISR_ERR1        (0U << 17)
#define DMAC_EBCISR_ERR2        (0U << 18)
#define DMAC_EBCISR_ERR3        (0U << 19)
#define DMAC_EBCISR_ERR4        (0U << 20)
#define DMAC_EBCISR_ERR5        (0U << 21)
#define DMAC_CHER               (*((volatile unsigned long *)0x400C4028U))
#define DMAC_CHER_ENA0          (1U << 0)
#define DMAC_CHER_ENA1          (0U << 1)
#define DMAC_CHER_ENA2          (0U << 2)
#define DMAC_CHER_ENA3          (0U << 3)
#define DMAC_CHER_ENA4          (0U << 4)
#define DMAC_CHER_ENA5          (0U << 5)
#define DMAC_CHER_SUSP0         (0U << 8)
#define DMAC_CHER_SUSP1         (0U << 9)
#define DMAC_CHER_SUSP2         (0U << 10)
#define DMAC_CHER_SUSP3         (0U << 11)
#define DMAC_CHER_SUSP4         (0U << 12)
#define DMAC_CHER_SUSP5         (0U << 13)
#define DMAC_CHER_KEEP0         (0U << 24)
#define DMAC_CHER_KEEP1         (0U << 25)
#define DMAC_CHER_KEEP2         (0U << 26)
#define DMAC_CHER_KEEP3         (0U << 27)
#define DMAC_CHER_KEEP4         (0U << 28)
#define DMAC_CHER_KEEP5         (0U << 29)
#define DMAC_CHDR               (*((volatile unsigned long *)0x400C402CU))
#define DMAC_CHDR_DIS0          (0U << 0)
#define DMAC_CHDR_DIS1          (0U << 1)
#define DMAC_CHDR_DIS2          (0U << 2)
#define DMAC_CHDR_DIS3          (0U << 3)
#define DMAC_CHDR_DIS4          (0U << 4)
#define DMAC_CHDR_DIS5          (0U << 5)
#define DMAC_CHDR_RES0          (0U << 8)
#define DMAC_CHDR_RES1          (0U << 9)
#define DMAC_CHDR_RES2          (0U << 10)
#define DMAC_CHDR_RES3          (0U << 11)
#define DMAC_CHDR_RES4          (0U << 12)
#define DMAC_CHDR_RES5          (0U << 13)
#define DMAC_CHSR               (*((volatile unsigned long *)0x400C4030U))
#define DMAC_CHSR_ENA0          (1U << 0)
#define DMAC_CHSR_ENA1          (1U << 1)
#define DMAC_CHSR_ENA2          (1U << 2)
#define DMAC_CHSR_ENA3          (1U << 3)
#define DMAC_CHSR_ENA4          (1U << 4)
#define DMAC_CHSR_ENA5          (1U << 5)
#define DMAC_CHSR_SUSP0         (1U << 8)
#define DMAC_CHSR_SUSP1         (1U << 9)
#define DMAC_CHSR_SUSP2         (1U << 10)
#define DMAC_CHSR_SUSP3         (1U << 11)
#define DMAC_CHSR_SUSP4         (1U << 12)
#define DMAC_CHSR_SUSP5         (1U << 13)
#define DMAC_CHSR_EMPT0         (1U << 16)
#define DMAC_CHSR_EMPT1         (1U << 17)
#define DMAC_CHSR_EMPT2         (1U << 18)
#define DMAC_CHSR_EMPT3         (1U << 19)
#define DMAC_CHSR_EMPT4         (1U << 20)
#define DMAC_CHSR_EMPT5         (1U << 21)
#define DMAC_CHSR_STAL0         (1U << 24)
#define DMAC_CHSR_STAL1         (1U << 25)
#define DMAC_CHSR_STAL2         (1U << 26)
#define DMAC_CHSR_STAL3         (1U << 27)
#define DMAC_CHSR_STAL4         (1U << 28)
#define DMAC_CHSR_STAL5         (1U << 29)
#define DMAC_SADDR0(value)      (*((volatile unsigned long *)(0x400C403CU + \
                                (40 * value))))
#define DMAC_SADDR1             (*((volatile unsigned long *)0x400C4064U))
#define DMAC_SADDR2             (*((volatile unsigned long *)0x400C408CU))
#define DMAC_SADDR3             (*((volatile unsigned long *)0x400C40B4U))
#define DMAC_SADDR4             (*((volatile unsigned long *)0x400C40DCU))
#define DMAC_SADDR5             (*((volatile unsigned long *)0x400C4104U))
#define DMAC_DADDR0(value)      (*((volatile unsigned long *)(0x400C4040U + \
                                (40 * value))))
#define DMAC_DADDR1             (*((volatile unsigned long *)0x400C4068U))
#define DMAC_DADDR2             (*((volatile unsigned long *)0x400C4090U))
#define DMAC_DADDR3             (*((volatile unsigned long *)0x400C40B8U))
#define DMAC_DADDR4             (*((volatile unsigned long *)0x400C40E0U))
#define DMAC_DADDR5             (*((volatile unsigned long *)0x400C4108U))
#define DMAC_DSCR0              (*((volatile unsigned long *)0x400C4044U))
#define DMAC_DSCR1              (*((volatile unsigned long *)0x400C406CU))
#define DMAC_DSCR2              (*((volatile unsigned long *)0x400C4094U))
#define DMAC_DSCR3              (*((volatile unsigned long *)0x400C40BCU))
#define DMAC_DSCR4              (*((volatile unsigned long *)0x400C40E4U))
#define DMAC_DSCR5              (*((volatile unsigned long *)0x400C410CU))
#define DMAC_CTRLA0(value)      (*((volatile unsigned long *)(0x400C4048U + \
                                (40 * value))))
#define DMAC_CTRLA0_BTSIZE      (uint16_t)(0x20U << 0)  // 32 bit
#define DMAC_CTRLA0_SCSIZE      (0x0U << 16)
#define DMAC_CTRLA0_DCSIZE      (0x0U << 20)
#define DMAC_CTRLA0_SRC_WIDTH   (0x2U << 24)
#define DMAC_CTRLA0_DST_WIDTH   (0x2U << 28)
#define DMAC_CTRLA0_DONE        (1U << 31)
#define DMAC_CTRLA1             (*((volatile unsigned long *)0x400C4070U))
#define DMAC_CTRLA1_BTSIZE      (0xFFFFU << 0)
#define DMAC_CTRLA1_SCSIZE      (0xFU << 16)
#define DMAC_CTRLA1_DCSIZE      (0xFU << 20)
#define DMAC_CTRLA1_SRC_WIDTH   (0xFU << 24)
#define DMAC_CTRLA1_DST_WIDTH   (0xFU << 28)
#define DMAC_CTRLA1_DONE        (0U << 31)
#define DMAC_CTRLA2             (*((volatile unsigned long *)0x400C4098U))
#define DMAC_CTRLA2_BTSIZE      (0xFFFFU << 0)
#define DMAC_CTRLA2_SCSIZE      (0xFU << 16)
#define DMAC_CTRLA2_DCSIZE      (0xFU << 20)
#define DMAC_CTRLA2_SRC_WIDTH   (0xFU << 24)
#define DMAC_CTRLA2_DST_WIDTH   (0xFU << 28)
#define DMAC_CTRLA2_DONE        (0U << 31)
#define DMAC_CTRLA3             (*((volatile unsigned long *)0x400C40C0U))
#define DMAC_CTRLA3_BTSIZE      (0xFFFFU << 0)
#define DMAC_CTRLA3_SCSIZE      (0xFU << 16)
#define DMAC_CTRLA3_DCSIZE      (0xFU << 20)
#define DMAC_CTRLA3_SRC_WIDTH   (0xFU << 24)
#define DMAC_CTRLA3_DST_WIDTH   (0xFU << 28)
#define DMAC_CTRLA3_DONE        (0U << 31)
#define DMAC_CTRLA4             (*((volatile unsigned long *)0x400C40E8U))
#define DMAC_CTRLA4_BTSIZE      (0xFFFFU << 0)
#define DMAC_CTRLA4_SCSIZE      (0xFU << 16)
#define DMAC_CTRLA4_DCSIZE      (0xFU << 20)
#define DMAC_CTRLA4_SRC_WIDTH   (0xFU << 24)
#define DMAC_CTRLA4_DST_WIDTH   (0xFU << 28)
#define DMAC_CTRLA4_DONE        (0U << 31)
#define DMAC_CTRLA5             (*((volatile unsigned long *)0x400C4110U))
#define DMAC_CTRLA5_BTSIZE      (0xFFFFU << 0)
#define DMAC_CTRLA5_SCSIZE      (0xFU << 16)
#define DMAC_CTRLA5_DCSIZE      (0xFU << 20)
#define DMAC_CTRLA5_SRC_WIDTH   (0xFU << 24)
#define DMAC_CTRLA5_DST_WIDTH   (0xFU << 28)
#define DMAC_CTRLA5_DONE        (0U << 31)
#define DMAC_CTRLB0(value)      (*((volatile unsigned long *)(0x400C404CU + \
                                (40 * value))))
#define DMAC_CTRLB0_SRC_DSCR    (1U << 16)
#define DMAC_CTRLB0_DST_DSCR    (1U << 20)
#define DMAC_CTRLB0_FC          (0x0U << 21)
#define DMAC_CTRLB0_SRC_INCR    (0x2U << 24)
#define DMAC_CTRLB0_DST_INCR    (0x2U << 28)
#define DMAC_CTRLB0_IEN         (0U << 30)
#define DMAC_CTRLB1             (*((volatile unsigned long *)0x400C4074U))
#define DMAC_CTRLB1_SRC_DSCR    (0U << 16)
#define DMAC_CTRLB1_DST_DSCR    (0U << 20)
#define DMAC_CTRLB1_FC          (0xFU << 21)
#define DMAC_CTRLB1_SRC_INCR    (0xFU << 24)
#define DMAC_CTRLB1_DST_INCR    (0xFU << 28)
#define DMAC_CTRLB1_IEN         (0U << 30)
#define DMAC_CTRLB2             (*((volatile unsigned long *)0x400C409CU))
#define DMAC_CTRLB2_SRC_DSCR    (0U << 16)
#define DMAC_CTRLB2_DST_DSCR    (0U << 20)
#define DMAC_CTRLB2_FC          (0xFU << 21)
#define DMAC_CTRLB2_SRC_INCR    (0xFU << 24)
#define DMAC_CTRLB2_DST_INCR    (0xFU << 28)
#define DMAC_CTRLB2_IEN         (0U << 30)
#define DMAC_CTRLB3             (*((volatile unsigned long *)0x400C40C4U))
#define DMAC_CTRLB3_SRC_DSCR    (0U << 16)
#define DMAC_CTRLB3_DST_DSCR    (0U << 20)
#define DMAC_CTRLB3_FC          (0xFU << 21)
#define DMAC_CTRLB3_SRC_INCR    (0xFU << 24)
#define DMAC_CTRLB3_DST_INCR    (0xFU << 28)
#define DMAC_CTRLB3_IEN         (0U << 30)
#define DMAC_CTRLB4             (*((volatile unsigned long *)0x400C40ECU))
#define DMAC_CTRLB4_SRC_DSCR    (0U << 16)
#define DMAC_CTRLB4_DST_DSCR    (0U << 20)
#define DMAC_CTRLB4_FC          (0xFU << 21)
#define DMAC_CTRLB4_SRC_INCR    (0xFU << 24)
#define DMAC_CTRLB4_DST_INCR    (0xFU << 28)
#define DMAC_CTRLB4_IEN         (0U << 30)
#define DMAC_CTRLB5             (*((volatile unsigned long *)0x400C4114U))
#define DMAC_CTRLB5_SRC_DSCR    (0U << 16)
#define DMAC_CTRLB5_DST_DSCR    (0U << 20)
#define DMAC_CTRLB5_FC          (0xFU << 21)
#define DMAC_CTRLB5_SRC_INCR    (0xFU << 24)
#define DMAC_CTRLB5_DST_INCR    (0xFU << 28)
#define DMAC_CTRLB5_IEN         (0U << 30)
#define DMAC_CFG0(value)        (*((volatile unsigned long *)(0x400C4050U + \
                                (40 * value))))
#define DMAC_CFG0_SRC_PER       (0x4U << 0)
#define DMAC_CFG0_DST_PER       (0x0U << 4)
#define DMAC_CFG0_SRC_H2SEL     (1U << 9)
#define DMAC_CFG0_DST_H2SEL     (1U << 13)
#define DMAC_CFG0_SOD(value)    ((0x1U << 16) & (value << 16))
#define DMAC_CFG0_LOCK_IF       (0U << 20)
#define DMAC_CFG0_LOCK_B        (0U << 21)
#define DMAC_CFG0_LOCK_IF_L     (0U << 22)
#define DMAC_CFG0_AHB_PROT      ((0x7U << 24) & (1U << 24))
#define DMAC_CFG0_FIFOCFG       ((0x3U << 28) & (0U << 28))
#define DMAC_CFG1               (*((volatile unsigned long *)0x400C4078U))
#define DMAC_CFG1_SRC_PER       (0xFU << 0)
#define DMAC_CFG1_DST_PER       (0xFU << 4)
#define DMAC_CFG1_SRC_H2SEL     (0U << 9)
#define DMAC_CFG1_DST_H2SEL     (0U << 13)
#define DMAC_CFG1_SOD           (0U << 16)
#define DMAC_CFG1_LOCK_IF       (0U << 20)
#define DMAC_CFG1_LOCK_B        (0U << 21)
#define DMAC_CFG1_LOCK_IF_L     (0U << 22)
#define DMAC_CFG1_AHB_PROT      (0xFU << 24)
#define DMAC_CFG1_FIFOCFG       (0xFU << 28)
#define DMAC_CFG2               (*((volatile unsigned long *)0x400C40A0U))
#define DMAC_CFG2_SRC_PER       (0xFU << 0)
#define DMAC_CFG2_DST_PER       (0xFU << 4)
#define DMAC_CFG2_SRC_H2SEL     (0U << 9)
#define DMAC_CFG2_DST_H2SEL     (0U << 13)
#define DMAC_CFG2_SOD           (0U << 16)
#define DMAC_CFG2_LOCK_IF       (0U << 20)
#define DMAC_CFG2_LOCK_B        (0U << 21)
#define DMAC_CFG2_LOCK_IF_L     (0U << 22)
#define DMAC_CFG2_AHB_PROT      (0xFU << 24)
#define DMAC_CFG2_FIFOCFG       (0xFU << 28)
#define DMAC_CFG3               (*((volatile unsigned long *)0x400C40C8U))
#define DMAC_CFG3_SRC_PER       (0xFU << 0)
#define DMAC_CFG3_DST_PER       (0xFU << 4)
#define DMAC_CFG3_SRC_H2SEL     (0U << 9)
#define DMAC_CFG3_DST_H2SEL     (0U << 13)
#define DMAC_CFG3_SOD           (0U << 16)
#define DMAC_CFG3_LOCK_IF       (0U << 20)
#define DMAC_CFG3_LOCK_B        (0U << 21)
#define DMAC_CFG3_LOCK_IF_L     (0U << 22)
#define DMAC_CFG3_AHB_PROT      (0xFU << 24)
#define DMAC_CFG3_FIFOCFG       (0xFU << 28)
#define DMAC_CFG4               (*((volatile unsigned long *)0x400C40F0U))
#define DMAC_CFG4_SRC_PER       (0xFU << 0)
#define DMAC_CFG4_DST_PER       (0xFU << 4)
#define DMAC_CFG4_SRC_H2SEL     (0U << 9)
#define DMAC_CFG4_DST_H2SEL     (0U << 13)
#define DMAC_CFG4_SOD           (0U << 16)
#define DMAC_CFG4_LOCK_IF       (0U << 20)
#define DMAC_CFG4_LOCK_B        (0U << 21)
#define DMAC_CFG4_LOCK_IF_L     (0U << 22)
#define DMAC_CFG4_AHB_PROT      (0xFU << 24)
#define DMAC_CFG4_FIFOCFG       (0xFU << 28)
#define DMAC_CFG5               (*((volatile unsigned long *)0x400C4118U))
#define DMAC_CFG5_SRC_PER       (0xFU << 0)
#define DMAC_CFG5_DST_PER       (0xFU << 4)
#define DMAC_CFG5_SRC_H2SEL     (0U << 9)
#define DMAC_CFG5_DST_H2SEL     (0U << 13)
#define DMAC_CFG5_SOD           (0U << 16)
#define DMAC_CFG5_LOCK_IF       (0U << 20)
#define DMAC_CFG5_LOCK_B        (0U << 21)
#define DMAC_CFG5_LOCK_IF_L     (0U << 22)
#define DMAC_CFG5_AHB_PROT      (0xFU << 24)
#define DMAC_CFG5_FIFOCFG       (0xFU << 28)

/* DMAC Write Protect Mode Register */
#define DMAC_WPMR               (*((volatile unsigned long *)0x400C41E4U))
#define DMAC_WPKEY              (0x50494FU << 8)

#endif